package com;

public class TaskList {
    /*
    Задание 1
    В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал.
    Использование YouTube, Quizful приветствуется.
    *
    Задание 2
    Используя Intelij IDEA создать проект, пакет.
    Создать класс Машина с полями год(int), цвет(String).
    Создать конструктор по умолчанию, конструктор с одним и 2-я параметрами.
    Создать класс Main в котором создать экземпляры вызывая разные конструкторы.
    *
    * Задание 3
    Используя Intelij IDEA создать проект, пакет.
    (Заново!) Создать класс Машина с полями год(int), скорость(double), вес(int) цвет(String).
    Создать конструктор по умолчанию, конструктор с 1-м параметром, 2-я, 3-я, 4-я.
    Перегрузить конструкторы.
    Создать класс Main, в котором создать экземляры класса Машина с разными параметрами.
    *
    * Задание 4
    Используя Intelij IDEA создать проект, пакет.
    (Заново!) Создать класс Машина с полями год(int), скорость(double), вес(int) цвет(String).
    Создать конструктор по умолчанию, конструктор с 1-м параметром, 2-я, 3-я, 4-я.
    Перегрузить конструкторы вызывая конструктор из конструктора.
    Создать класс Main, в котором создать экземляры класса Машина с разными параметрами.
    *
    * Дополнительное 1
    * Используя Intelij IDEA создать проект, пакет.
    Создать класс MyArea, в нем объявить константу PI = 3.14 и статический метод areaOfCircle, который
    должен принимать радиус и используя PI посчитать площадь круга.
    Создать класс Main, где запустить данный метод.
    *
    * Лабораторка 1
    * Реализуйте класс “Студент”. Необходимо хранить в полях класса: ФИО, дату рождения, контактный телефон, номер группы.
    Реализуйте методы класса для ввода данных, вывода данных, реализуйте аксессоры для доступа к отдельным полям,
    а также конструктор с параметрами.
    *
    * Лабораторка 2
    * Реализуйте класс Дробь. Необходимо хранить числитель и знаменатель в качестве полей.
    Реализуйте методы для ввода данных в поля, а также конструктор с параметрами. Выполните арифметические операции
    (сложение, вычитание, умножение, деление, и т.д.) дроби с дробью.
    * */
}
