package com.company;

public class TaskList {

    /*
    Лабораторка:
    Создать класс Car со следующими полями:
    • id,
    • Марка,
    • Модель,
    • Год выпуска,
    • Цвет,
    • Цена,
    • Регистрационный номер.

    Определить конструкторы и методы setТип(), getТип(), toString(). В классе Car переопределить методы equals и hashCode.
    Создать массив объектов.

    Приложение при старте, выводит в консоли текстовое меню для выполнения
    пользователем нижеперечисленных операций.
    Вывести:
    a) список марок автомобилей из созданного массива объектов;
    b) список автомобилей, которые эксплуатируются больше n лет;
    c) список автомобилей заданного года выпуска, цена которых больше указанной.
    d) количество одинаковых автомобилей сравнивая с первым автомобилем (который помещен в массив) и саму характеристику автомобиля (используя toString())

    Постройте структуру меню приложения таким образом, чтобы пользователь
    мог последовательно вводить параметры поиска и получать результат. После
    выполнения выбранной операции, на экран должен выводиться результат и
    снова пользователю предлагается выполнить одну из операций до тех пор,
    пока пользователь выполнить выход из приложения.
     */
}
