package com.company;

public class TaskList {

    /*
    Задание 1
    В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал.
    Использование YouTube, Quizful приветствуется.

    Задание 2
    Создать классы:
    1) Основной класс Device (manufacturer(String), price(float), serialNumber(String));
    2) Сабкалсс Monitor (resolutionX(int), resolutionY(int)) and EthernetAdapter (speed (int), mac (String));
    Добавить методы доступа. Конструктор.

    Задание 3
    Смотреть задание 2.
    В обоих классах переопределить метод toString, что бы вывод был следующим:
    Device: manufacturer =Samsung, price=120, serialNumber=AB1234567CD
    Monitor: manufacturer =Samsung, price=120, serialNumber=AB1234567CD, X=1280,Y=1024

    Задание 4
    Смотреть задание 2.
    Переопределить методы equals & hashCode в каждом классе.
    Создать класс Main, в котором создать объекты классов и продемонстрировать переопределенные
    методы.
    
    Дополнительное
    Используя Intelij IDEA создать проект, пакет.
    Создать класс Animal с именем String, возрастом int, хвостом Boolean. В классе переопределить метод
    toString, что бы вывод был сдедующим
    «Имя: Васька, возраст: 45, хвост: нет».
    В классе Animal переопределить методы equals & hashCode.

    Лабораторка:
    Создать класс Car со следующими полями:
    • id,
    • Марка,
    • Модель,
    • Год выпуска,
    • Цвет,
    • Цена,
    • Регистрационный номер.

    Определить конструкторы и методы setТип(), getТип(), toString(). В классе Car переопределить методы equals и hashCode.
    Создать массив объектов.

    Приложение при старте, выводит в консоли текстовое меню для выполнения
    пользователем нижеперечисленных операций.
    Вывести:
    a) список марок автомобилей из созданного массива объектов;
    b) список автомобилей, которые эксплуатируются больше n лет;
    c) список автомобилей заданного года выпуска, цена которых больше указанной.
    d) количество одинаковых автомобилей сравнивая с первым автомобилем (который помещен в массив) и саму характеристику автомобиля (используя toString())

    Постройте структуру меню приложения таким образом, чтобы пользователь
    мог последовательно вводить параметры поиска и получать результат. После
    выполнения выбранной операции, на экран должен выводиться результат и
    снова пользователю предлагается выполнить одну из операций до тех пор,
    пока пользователь выполнить выход из приложения.
     */
}
