public class TaskList {
    /*
    *Задание 1
    В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал.
    Использование YouTube, Quizful приветствуется.
    *
    Задание 2
    Используя Intelij IDEA создать проект, пакет.
    Создать класс Zoo. В классе создать список, в который записать 8 животных через метод add(index,
    element).
    Вывести список в консоль.
    *
    Задание 3
    Используя Intelij IDEA создать проект, пакет.
    Используя класс Zoo Задания 2, удалить 3, 5, 7 животные, узнать размер списка и вывести в консоль.
    *
    Задание 4
    Используя Intelij IDEA создать проект, пакет.
    Создать класс Main, создать список целых чисел и используя ListIterator пройтись по списку и увеличить
    значения на 1;
    *
    Дополнительное 1
    Используя Intelij IDEA создать проект, пакет.
    Создать class Main, в нем создать список, добавить учителей, которых вы только сможете вспомнить со
    школы. И получить индекс самого лучшего учителя и самого не очень. Вывести список в консоль.
    *
    Лабораторка 1
    Пользователь вводит с клавиатуры набор чисел. Полученные числа необходимо сохранить в список. После
    чего нужно показать меню, в котором предложить пользователю набор пунктов:
    1. Добавить элемент в список;
    2. Удалить элемент из списка;
    3. Показать содержимое списка;
    4. Проверить есть ли значение в списке;
    5. Заменить значение в списке.
    В зависимости от выбора пользователя выполняется
    действие, после чего меню отображается снова.
    * */
}
