package com.company;

public class TaskList {

    /*
    *Задание 1
    Выучите основные конструкции и понятия, рассмотренные на уроке.
    *
    Задание 2
    Создайте проект, используя IntelliJ IDEA.
    Требуется:
    Создать класс Vehicle с методом print. В классе Vehicle, создайте внутренний класс Wheel и Door,
    которые также должны содержать метод print. Создайте экземпляры классов Wheel и Door.
    *
    Задание 3
    Создайте проект, используя IntelliJ IDEA.
    Требуется:
    Создать класс Distance с полем distance типа double и методом print. В классе Distance, создайте
    статический класс Converter с методами, которые будут конвертировать расстояние в разные единицы
    измерения (к примеру, из метров в километры, из километров в мили, и так далее).
    *
    Задание 4
    Зайдите на сайт Oracle.
    Используя поисковые механизмы Oracle, найдите самостоятельно описание темы по каждому примеру,
    который был рассмотрен на уроке, так, как это представлено ниже, в разделе «Рекомендуемые
    ресурсы», описания данного урока. Сохраните ссылки и дайте им короткое описание.
    *
    Дополнительное 1
    Используя IntelliJ IDEA, создайте проект.
    Требуется:
    Создать класс Calculator, с методами для выполнения основных арифметических операций.
    *
    Лабораторка 1
    Задание 1
    - Создать класс User, содержащий private переменные login, password.
    - Создать внутренний класс Query в классе User. Класс Query содержит метод printToLog(),
    который распечатывает на консоль сообщение о том что пользователь с таким то логином и паролем отправил запрос.
    - Класс User, содержит метод createQuery(), в котором создается объект класса Query и вызывается метод printToLog().

    В методе main():
    - создать экземпляр класса User и вызвать метод createQuery();
    - создать экземпляр класса Query и вызвать метод printToLog() используя конструкцию user.new Query();
    - создать экземпляр класса Query и вызвать метод printToLog() используя конструкцию new User().new Query();
    *
    Лабораторка 2
    Переписать предыдущее задание, используя локальный класс
    * */
}
