package com.company;

public class TaskList {

    /*
    Задание 1
    Выучите основные конструкции и понятия, рассмотренные на уроке.

    Задание 2
    Создайте проект, используя IntelliJ IDEA.
    Создайте перечислительный тип (enum) Animals, содержащий конструктор, который должен принимать
    целочисленное значение (возраст животного), и содержать перегруженный метод toString(), который
    должен возвращать название экземпляра и возраст животного.

    Задание 3
    Зайдите на сайт Oracle.
    Используя поисковые механизмы Oracle, найдите самостоятельно описание темы по каждому примеру,
    который был рассмотрен на уроке, так, как это представлено ниже, в разделе «Рекомендуемые
    ресурсы», описания данного урока. Сохраните ссылки и дайте им короткое описание.

    дополнительное 1
    Создайте проект, используя IntelliJ IDEA.
    Создайте перечислительный тип (enum) Vehicles, содержащий конструктор, который должен принимать
    целочисленное значение (стоимость автомобиля), содержать метод getColor(), который возвращает
    строку с цветом автомобиля, и содержать перегруженный метод toString(), который должен возвращать
    строку с названием экземпляра, цветом и стоимостью автомобиля.

    Лабораборка
    Интерфейс Printable
    - Определить интерфейс Printable, содержащий метод void print().
    - Определить класс Book, реализующий интерфейс Printable.
    - Определить класс Magazine, реализующий интерфейс Printable.
    - Создать анонимный класс расширяющий интерфейс Printable, в методе print() которого будут печататься газеты.
    - Создать массив типа Printable, который будет содержать книги, журналы и обьект анонимного класса.
    - В цикле пройти по массиву и вызвать метод print() для каждого объекта.
     */
}
