package com.company;

public class TaskList {

    /*
    дополнительное Задание
    Создайте проект, используя IntelliJ IDEA.
    Создайте перечислительный тип (enum) Vehicles, содержащий конструктор, который должен принимать
    целочисленное значение (стоимость автомобиля), содержать метод getColor(), который возвращает
    строку с цветом автомобиля, и содержать перегруженный метод toString(), который должен возвращать
    строку с названием экземпляра, цветом и стоимостью автомобиля.
     */
}
