package сom.company;

public class TaskList {
    /*
    Задание 1
    Выучите основные конструкции и понятия, рассмотренные на уроке.

    Задание 2
    Создайте проект, используя IntelliJ IDEA.
    Требуется:
    Описать класс с именем Worker, содержащую следующие поля:
    
    фамилия и инициалы работника;
    
    название занимаемой должности;
    
    год поступления на работу.
    Написать программу, выполняющую следующие действия:
    
    ввод с клавиатуры данных в массив, состоящий из пяти элементов типа Worker (записи должны
    быть упорядочены по алфавиту);
    
    если значение года введено не в соответствующем формате выдает исключение.
    
    вывод на экран фамилии работника, стаж работы которого превышает введенное значение.

    Задание 3
    Создайте проект, используя IntelliJ IDEA.
    Требуется: Описать класс с именем Price, содержащую следующие поля:
    
    название товара;
    
    название магазина, в котором продается товар;
    
    стоимость товара в гривнах.
    Написать программу, выполняющую следующие действия:
    
    ввод с клавиатуры данных в массив, состоящий из двух элементов типа Price (записи должны
    быть упорядочены в алфавитном порядке по названиям магазинов);
    
    вывод на экран информации о товарах, продающихся в магазине, название которого введено с
    клавиатуры (если такого магазина нет, вывести исключение).

    Задание 4
    Зайдите на сайт Oracle.
    Используя поисковые механизмы Oracle, найдите самостоятельно описание темы по каждому примеру,
    который был рассмотрен на уроке, так, как это представлено ниже, в разделе «Рекомендуемые
    ресурсы», описания данного урока. Сохраните ссылки и дайте им короткое описание.

    дополнительное
    Создайте проект, используя IntelliJ IDEA.
    Создайте класс Calculator.
    В теле класса создайте четыре метода для арифметических действий: (add – сложение, sub – вычитание,
    mul – умножение, div – деление).
    Метод деления должен делать проверку деления на ноль, если проверка не проходит, сгенерировать
    исключение.
    Пользователь вводит значения, над которыми хочет произвести операцию и выбрать саму операцию.
    При возникновении ошибок должны выбрасываться исключения.

    лабораторка
    Создайте свой класс исключения для проверки выгула животного.
Программа должна содержать несколько методов, проверяющий экипировку животного (например: ошейник, поводок и тд.) и
результирующий метод «выгул». Если одно из требований хотя бы не выполнено, то выбросить свое исключение или же отработать нормально
     */
}
